///********************************************************************
//1. 题目来源：https://leetcode-cn.com/problems/reverse-integer/
//
//2. 原题
//7. 整数反转
//给你一个 32 位的有符号整数 x ，返回将 x 中的数字部分反转后的结果。
//如果反转后整数超过 32 位的有符号整数的范围 [−231,  231 − 1] ，就返回 0。
//假设环境不允许存储 64 位整数（有符号或无符号）。
//
//
//示例 1：
//输入：x = 123
//输出：321
//示例 2：
//
//输入：x = -123
//输出：-321
//示例 3：
//
//输入：x = 120
//输出：21
//示例 4：
//
//输入：x = 0
//输出：0
//
//3. 归类：
//
//4. 解题要点
//
//**********************************************************************/
//
///*************************头文件*****************************/
//#include <iostream>
//#include <vector>
//#include <set>
//#include <algorithm>
//#include <stack>
//#include <map>
//using namespace std;
//
///*************************实现函数*****************************/
//class Solution {
//public:
//	int reverse(int x) {
//		int y = 0;
//		if (x >= INT_MAX || x <= INT_MIN) return 0;
//		int flag = 0;
//		while (x != 0) {
//			int tmp = x % 10;
//			if (y>(INT_MAX-tmp)/10|| y <(INT_MIN+tmp)/10) {
//				return 0;
//			}
//			y = y * 10 + tmp;
//			x = x / 10;
//		}
//		return y;
//	}
//};
//
///*************************main函数 输入输出*****************************/
//int main() {
//
//	int in = -123;
//	Solution s1;
//	cout<<s1.reverse(in)<<endl;
//
//	system("pause");
//	return 0;
//}
